#+title: App C Counting And Probability
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-04-15>
#+lastmod: <2026-04-17 13:34>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

** Code

#+begin_src julia :results output
using UnicodePlots

function bounces(layers, balls)
    results = Vector{Int}(undef, balls)
    for i in 1:balls
        displacement = 0
        for _ in 1:layers
            displacement += rand() > 0.5 ? 1 : -1
        end
        results[i] = displacement
    end
    return results
end

function main()
    results = bounces(15, 10000)
    histogram(results, nbins=21)
end

main()
#+end_src

#+RESULTS:
#+begin_example
bounces (generic function with 1 method)
main (generic function with 1 method)
                  ┌                                        ┐
   [-14.0, -12.0) ┤▏ 3
   [-12.0, -10.0) ┤▌ 32
   [-10.0,  -8.0) ┤██▏ 124
   [ -8.0,  -6.0) ┤██████▌ 402
   [ -6.0,  -4.0) ┤██████████████▊ 908
   [ -4.0,  -2.0) ┤████████████████████████▍ 1 497
   [ -2.0,   0.0) ┤████████████████████████████████▎ 1 971
   [  0.0,   2.0) ┤█████████████████████████████████  2 025
   [  2.0,   4.0) ┤████████████████████████▊ 1 524
   [  4.0,   6.0) ┤███████████████▎ 926
   [  6.0,   8.0) ┤██████▊ 419
   [  8.0,  10.0) ┤██▎ 133
   [ 10.0,  12.0) ┤▌ 31
   [ 12.0,  14.0) ┤▏ 5
                  └                                        ┘
                                   Frequency
#+end_example
